In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({'ProductName': ['Bulb', 'Bulb', 'Fan', 'Fan'], 
                   'Type': ['A', 'B', 'A', 'A'], 
                   'EC': [400, 300, 250, 300]})

In [4]:
df

  ProductName Type   EC
0        Bulb    A  400
1        Bulb    B  300
2         Fan    A  250
3         Fan    A  300

In [6]:
a = [['Bulb', 'Bulb', 'Bulb', 'Fan', 'Fan', 'Fan'], 
     ['A', 'B', 'C', 'A', 'B', 'C']]

idx = pd.MultiIndex.from_arrays(a, names = ('ProductName', 'Type'))
df = pd.DataFrame({'EC': [20, 30, 40, 25, 10, 30]}, index=idx)
df

                  EC
ProductName Type
Bulb        A     20
            B     30
            C     40
Fan         A     25
            B     10
            C     30

In [8]:
df.groupby(level=0).sum()

             EC
ProductName
Bulb         90
Fan          65

In [9]:
df.groupby(level=1).sum()

      EC
Type
A     45
B     40
C     70

In [10]:
df.groupby(level = 'ProductName').sum()

             EC
ProductName
Bulb         90
Fan          65

In [11]:
df.groupby(level = 'Type').sum()

      EC
Type
A     45
B     40
C     70